(function () {
	'use strict';
	retryWhileError(function () {
		NAinfo.requireApiVersion(0, 2);

		let variants = [
  {
    "code": "471700",
    "text": "Пирамида Хефрена имеет форму правильной четырехугольной пирамиды, сторона основания которой равна {n1} м, а высота — {n2} м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": null
  },
  {
    "code": "F0C5E1",
    "text": "Пирамида Снофру имеет форму правильной четырехугольной пирамиды, сторона основания которой равна 220 м, а высота — 104 м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": [
      220,
      104
    ]
  },
  {
    "code": "358BBC",
    "text": "Пирамида Снофру имеет форму правильной четырехугольной пирамиды, сторона основания которой равна {n1} м, а высота {n2} м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": null
  },
  {
    "code": "8F48C7",
    "text": "Пирамида Хеопса имеет форму правильной четырехугольной пирамиды, сторона основания которой равна 230 м, а высота — 147 м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": [
      230,
      147
    ]
  },
  {
    "code": "0B333A",
    "text": "Пирамида Снофру имеет форму правильной четырёхугольной пирамиды, сторона основания которой равна {n1} м, а высота {n2} м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": null
  },
  {
    "code": "20DB77",
    "text": "Пирамида Снофру имеет форму правильной четырёхугольной пирамиды, сторона основания которой равна 220 м, а высота 104 м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": [
      220,
      104
    ]
  },
  {
    "code": "D58E2A",
    "text": "Пирамида Хеопса имеет форму правильной четырёхугольной пирамиды, сторона основания которой равна {n1} м, а высота {n2} м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": null
  },
  {
    "code": "2D3EB2",
    "text": "Пирамида Снофру имеет форму правильной четырёхугольной пирамиды, сторона основания которой равна {n1} м, а высота пирамиды равна {n2} м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": null
  },
  {
    "code": "197E18",
    "text": "Пирамида Хефрена имеет форму правильной четырёхугольной пирамиды, сторона основания которой равна {n1} м, а высота пирамиды равна {n2} м. Сторона основания точной музейной копии этой пирамиды равна {n3} см. Найдите высоту музейной копии. Ответ дайте в сантиметрах.",
    "fixed": null
  }
];
		let preference = variants.map(v => v.code);
		let variant = variants[getSelectedPreferenceFromList('510709', preference)];
		let A, a2, ans10, H;
		do {
			A = sl(10, 30, 1) * 10;
			a2 = sl(10, 40, 1) * 5;
			ans10 = sl(10, 200, 1);
			if ((ans10 * A) % a2 === 0) {
				H = (ans10 * A) / a2;
				if (H >= 50 && H <= 250) {
					break;
				}
			}
		} while (true);

		if (variant.fixed) {
			A = variant.fixed[0]; H = variant.fixed[1];
			a2 = A * sl(1, 10); ans10 = H * a2 / A;
		}
		let a = a2 / 10;
		let ans = ans10 / 10;

		let aStr = String(a).replace('.', ',');

		// Статичная иллюстрация: правильная четырёхугольная пирамида,
		// невидимые рёбра (левое и заднее рёбра основания, заднее боковое) — пунктиром
		let paint1 = function (ct) {
			ct.translate(12, 72);
			ct.scale(20, -20);
			ct.lineWidth = 2 / 20;
			ct.drawRightPyramid4({
				edge: 5,
				height: 6.5,
			}, [1, 3, 6], [5 / 20, 2 / 20]);
		};

		NAtask.setTask({
			text: variant.text.replace('{n1}', '$' + A + '$').replace('{n2}', '$' + H + '$').replace('{n3}', '$' + aStr + '$'),
			preference: preference,
			answers: ans,
		});

		NAtask.modifiers.addCanvasIllustration({
			width: 220,
			height: 190,
			paint: paint1,
		});

		NAtask.modifiers.allDecimalsToStandard();
	}, 1000);
})();
//https://mathb-ege.sdamgia.ru/problem?id=510709
